In [3]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib notebook

In [6]:
# Handle CSV info

city_data1 = "city_data.csv"
ride_data1 = "ride_data.csv"

city_data_df = pd.read_csv(city_data1)
ride_data_df = pd.read_csv(ride_data1)

ride_data_df.head(5)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344

In [9]:
# Merge CSV

combined_city_df = pd.merge(city_data_df, ride_data_df,
                                 how='outer', on='city')

combined_city_df.head(5)

          city  driver_count   type                 date   fare        ride_id
0  Richardfort            38  Urban  2018-02-24 08:40:38  13.93  5628545007794
1  Richardfort            38  Urban  2018-02-13 12:46:07  14.00   910050116494
2  Richardfort            38  Urban  2018-02-16 13:52:19  17.92   820639054416
3  Richardfort            38  Urban  2018-02-01 20:18:28  10.26  9554935945413
4  Richardfort            38  Urban  2018-04-17 02:26:37  23.00   720020655850

In [ ]:
# info needed for bubble chart

#* Average Fare ($) Per City
#* Total Number of Rides Per City
#* Total Number of Drivers Per City
#* City Type (Urban, Suburban, Rural)

# info for pie chart

#* % of Total Fares by City Type
#* % of Total Rides by City Type
#* % of Total Drivers by City Type

In [11]:
clean_combined_city_df = combined_city_df.dropna(how="any")
clean_combined_city_df.count()

city            2375
driver_count    2375
type            2375
date            2375
fare            2375
ride_id         2375
dtype: int64

In [16]:
# Filter on city type

urban_type_df = clean_combined_city_df.loc[combined_city_df["type"] == "Urban", :]
suburban_type_df = clean_combined_city_df.loc[combined_city_df["type"] == "Suburban", :]
rural_type_df = clean_combined_city_df.loc[combined_city_df["type"] == "Rural", :]

rural_type_df.head()

,city,driver_count,type,date,fare,ride_id
2250,South Jennifer,7,Rural,2018-04-01 09:32:45,21.63,9135979586871
2251,South Jennifer,7,Rural,2018-03-07 19:10:13,48.79,9730627367446
2252,South Jennifer,7,Rural,2018-04-05 14:35:42,32.20,683983658392
2253,South Jennifer,7,Rural,2018-04-02 10:26:50,14.11,3828267773041
2254,South Jennifer,7,Rural,2018-04-10 20:46:11,43.25,623928772332